Repository: usamasultan2018/Expense_Nest
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: Expense Tracker
ur: ایکسپنس ٹریکر

source: register
ur: رجسٹر کریں

# onboardingTitle1
source: Track Your Spending Effortlessly
ur: اپنے اخراجات کو بے Effortlessly ٹریک کریں

# onboardingDescription1
source: Log your expenses quickly and keep an eye on where your money goes.
ur: اپنے اخراجات کو جلدی سے ریکارڈ کریں اور دیکھیں کہ آپ کا پیسہ کہاں جاتا ہے۔

# onboardingTitle2
source: Get Insights into Your Finances
ur: اپنے مالیات کے بارے میں بصیرت حاصل کریں

# onboardingDescription2
source: See real-time analytics and trends in your spending to help you make better financial decisions.
ur: ریئل ٹائم اینالٹکس اور اخراجات کے رجحانات دیکھیں تاکہ آپ بہتر مالی فیصلے کر سکیں۔

# onboardingTitle3
source: Organize with Custom Categories
ur: حسب ضرورت کیٹیگری کے ساتھ منظم ہوں

# onboardingDescription3
source: Categorize your expenses to suit your lifestyle and stay organized with ease.
ur: اپنے اخراجات کو اپنی زندگی کے مطابق کیٹیگری کریں اور آسانی سے منظم رہیں۔

# alreadyHaveAccount
source: Already have an account?
ur: کیا آپ کا اکاؤنٹ پہلے سے ہے؟

# welcomeBack
source: Hi, welcome back!
ur: ہیلو، خوش آمدید واپس!

source: You've been missed!
ur: ہمیں آپ کی کمی محسوس ہوئی!

# emailHint
source: Email
ur: ای میل

# passwordHint
source: Password
ur: پاسورڈ

# usernameHint
source: Username
ur: یوزر نام

source: Continue with Google
ur: گوگل کے ساتھ جاری رکھیں

# noAccountPrompt
source: Don't have an account?
ur: کیا آپ کا اکاؤنٹ نہیں ہے؟

source: Create Account
ur: اکاؤنٹ بنائیں

# loginButton
source: Login
ur: لاگ ان کریں

# signupButton
source: Sign Up
ur: سائن اپ کریں

# registerDescription
source: Register, create transaction and control your expense
ur: رجسٹر کریں، ٹرانزیکشن بنائیں اور اپنے اخراجات پر قابو پائیں

source: Home
ur: ہوم

source: Stats
ur: اسٹٹس

source: Transaction
ur: ٹرانزیکشن

source: View All
ur: سب دیکھیں

source: Total Balance
ur: مجموعی بیلنس

source: Income
ur: آمدنی

source: Expense
ur: اخراجات

source: No Transactions
ur: کوئی ٹرانزیکشن نہیں

# homeWelcomeMessage
source: Welcome back
ur: خوش آمدید واپس

# loginErrorMessage
source: Invalid email or password.
ur: غلط ای میل یا پاسورڈ۔

# signupErrorMessage
source: Sign up failed. Please try again.
ur: سائن اپ ناکام ہوگیا۔ براہ کرم دوبارہ کوشش کریں۔

# signupSuccessMessage
source: Sign up successful! Please check your email for verification.
ur: سائن اپ کامیاب! براہ کرم تصدیق کے لیے اپنے ای میل کو چیک کریں۔

# forgotPasswordButton
source: Forgot Password?
ur: پاسورڈ بھول گئے؟

# resetPasswordButton
source: Reset Password
ur: پاسورڈ ری سیٹ کریں

# resetPasswordTitle
source: Reset Password
ur: پاسورڈ ری سیٹ کریں

# resetPasswordDescription
source: Enter your email to reset your password.
ur: پاسورڈ ری سیٹ کرنے کے لیے اپنا ای میل درج کریں۔

# resetPasswordSuccessMessage
source: Password reset email sent. Please check your inbox.
ur: پاسورڈ ری سیٹ ای میل بھیج دیا گیا۔ براہ کرم اپنے ان باکس کو چیک کریں۔

# resetPasswordErrorMessage
source: Failed to send password reset email. Please try again.
ur: پاسورڈ ری سیٹ ای میل بھیجنے میں ناکامی۔ براہ کرم دوبارہ کوشش کریں۔

# transaction_date
source: Date
ur: تاریخ

# transaction_amount
source: Amount
ur: رقم

# transaction_time
source: Time
ur: وقت

# note_hint_text
source: Write a note
ur: نوٹ لکھیں

# date_hint_text
source: DD/MM/YYYY
ur: ڈی ڈی / ایم ایم / وائی وائی وائی وائی

# save_button
source: Save
ur: محفوظ کریں

source: My account
ur: میرا اکاؤنٹ

source: Appearance
ur: ظاہری شکل

# rate_app
source: Rate the app
ur: ایپ کو درجہ دیں

source: Settings
ur: ترتیبات

source: Account
ur: اکاؤنٹ

source: Language
ur: زبان

source: Info
ur: معلومات

source: Privacy Policy
ur: پرائیویسی پالیسی

source: Terms of Service
ur: خدمات کی شرائط

source: Contact
ur: رابطہ

source: Session
ur: سیشن

source: Logout
ur: لاگ آؤٹ

source: Delete Account
ur: اکاؤنٹ حذف کریں

source: English
ur: انگریزی

source: Spanish
ur: ہسپانوی

source: Select Language
ur: زبان منتخب کریں

source: Light
ur: ہلکا

source: Dark
ur: گہرا

source: System
ur: سسٹم

source: Theme
ur: تھیم

source: Login Information
ur: لاگ ان کی معلومات

source: Nickname
ur: نک نیم

source: Connected Account
ur: جڑا ہوا اکاؤنٹ

source: Registered on
ur: رجسٹرڈ پر

source: My Transactions
ur: میرے ٹرانزیکشنز

source: Recorded Incomes
ur: ریکارڈ شدہ آمدنی

source: Recorded Expenses
ur: ریکارڈ شدہ اخراجات

source: Edit Profile
ur: پروفائل ایڈٹ کریں

source: Email
ur: ای میل

source: Update Profile
ur: پروفائل اپ ڈیٹ کریں

source: Update
ur: اپ ڈیٹ کریں

# deleteTransactionTitle
source: Delete Transaction
ur: ٹرانزیکشن حذف کریں

# deleteTransactionMessage
source: Are you sure you want to delete this transaction?
ur: کیا آپ اس ٹرانزیکشن کو حذف کرنا چاہتے ہیں؟

source: Cancel
ur: منسوخ کریں

source: Delete
ur: حذف کریں

# terms_and_services_title
source: Terms and Services
ur: خدمات کی شرائط

# last_updated
source: Last updated: November 12, 2024
ur: آخری بار اپ ڈیٹ کیا گیا: 12 نومبر 2024

# accept_terms
source: By using the ExpenseNest app, you agree to comply with the following terms and conditions. If you do not agree to these terms, do not use the app.
ur: ایکسپنس نیسٹ ایپ استعمال کرکے آپ درج ذیل شرائط و ضوابط کی پابندی کرنے پر رضامند ہیں۔ اگر آپ ان شرائط سے متفق نہیں ہیں تو ایپ کا استعمال نہ کریں۔

# section_acceptance_of_terms
source: 1. Acceptance of Terms
ur: 1. شرائط کی قبولیت

# acceptance_of_terms
source: By accessing and using the ExpenseNest app, you accept and agree to be bound by these terms and conditions.
ur: ایکسپنس نیسٹ ایپ تک رسائی حاصل کرکے، آپ ان شرائط و ضوابط سے پابند ہونے کے لیے رضامند ہیں۔

# section_changes_to_terms
source: 2. Changes to Terms
ur: 2. شرائط میں تبدیلیاں

# changes_to_terms
source: We reserve the right to update or change these terms at any time. You are encouraged to review these terms periodically for any updates.
ur: ہم کسی بھی وقت ان شرائط کو اپ ڈیٹ یا تبدیل کرنے کا حق محفوظ رکھتے ہیں۔ آپ کو ان شرائط کا باقاعدگی سے جائزہ لینے کی ترغیب دی جاتی ہے۔

# section_user_responsibilities
source: 3. User Responsibilities
ur: 3. صارف کی ذمہ داریاں

# user_responsibilities
source: You are responsible for ensuring that your use of the app complies with applicable laws and regulations. You must not engage in any harmful, illegal, or unauthorized use of the app.
ur: آپ یہ یقینی بنانے کے ذمہ دار ہیں کہ ایپ کا استعمال متعلقہ قوانین اور ضوابط کے مطابق ہو۔ آپ کو ایپ کا کسی بھی قسم کا نقصان دہ، غیر قانونی یا غیر مجاز استعمال نہیں کرنا چاہیے۔

# section_account_registration
source: 4. Account Registration
ur: 4. اکاؤنٹ کی رجسٹریشن

# account_registration
source: To use certain features of the app, you may need to create an account. You agree to provide accurate and complete information when registering and to keep your account information secure.
ur: ایپ کی کچھ خصوصیات استعمال کرنے کے لیے آپ کو اکاؤنٹ بنانا پڑسکتا ہے۔ آپ اس بات پر رضامند ہیں کہ آپ درست اور مکمل معلومات فراہم کریں گے اور اپنے اکاؤنٹ کی معلومات کو محفوظ رکھیں گے۔

# section_data_privacy
source: 5. Data Privacy
ur: 5. ڈیٹا کی رازداری

# data_privacy
source: Your personal data is collected and used according to our Privacy Policy. By using the app, you consent to our data practices as outlined in the Privacy Policy.
ur: آپ کا ذاتی ڈیٹا ہماری پرائیویسی پالیسی کے مطابق جمع اور استعمال کیا جاتا ہے۔ ایپ استعمال کرتے ہوئے، آپ ہماری ڈیٹا کے طریقوں کے لیے رضامند ہیں جو پرائیویسی پالیسی میں بیان کیے گئے ہیں۔

# section_intellectual_property
source: 6. Intellectual Property
ur: 6. دانشورانہ املاک

# intellectual_property
source: The content and materials in the app, including logos, trademarks, and software, are protected by intellectual property laws. You may not use or reproduce them without our permission.
ur: ایپ میں موجود مواد اور مواد، بشمول لوگو، ٹریڈ مارکس، اور سافٹ ویئر، دانشورانہ املاک کے قوانین سے محفوظ ہیں۔ آپ ان کا استعمال یا نقل کرنے کی اجازت نہیں رکھتے بغیر ہماری اجازت کے۔

# section_termination_of_service
source: 7. Termination of Service
ur: 7. سروس کی معطلی

# termination_of_service
source: We may suspend or terminate your access to the app if you violate these terms. You agree that we are not liable for any damages resulting from such termination.
ur: اگر آپ ان شرائط کی خلاف ورزی کرتے ہیں تو ہم ایپ تک آپ کی رسائی معطل یا ختم کر سکتے ہیں۔ آپ اس بات پر رضامند ہیں کہ ہم ایسی معطلی سے ہونے والے کسی بھی نقصانات کے لیے ذمہ دار نہیں ہوں گے۔

# section_limitation_of_liability
source: 8. Limitation of Liability
ur: 8. ذمہ داری کی حد

# limitation_of_liability
source: To the fullest extent permitted by law, we will not be liable for any indirect, incidental, or consequential damages arising from your use of the app.
ur: قانون کی حد تک، ہم ایپ کے استعمال سے پیدا ہونے والے کسی بھی بالواسطہ، اتفاقی یا غیر متوقع نقصانات کے لیے ذمہ دار نہیں ہوں گے۔

# section_governing_law
source: 9. Governing Law
ur: 9. حکومت کرنے والا قانون

# governing_law
source: These terms are governed by and construed in accordance with the laws of your country. Any disputes arising from these terms will be resolved in the competent courts of your jurisdiction.
ur: یہ شرائط آپ کے ملک کے قوانین کے مطابق حکومتی طور پر نافذ اور سمجھوتے کی جائیں گی۔ ان شرائط سے پیدا ہونے والے تنازعات کو آپ کے دائرہ اختیار کے متعلقہ عدالتوں میں حل کیا جائے گا۔

# section_contact_us
source: 10. Contact Us
ur: 10. ہم سے رابطہ کریں

# contact_us
source: If you have any questions about these terms, please contact us at: Email: support@expensenest.com
ur: اگر آپ کے پاس ان شرائط کے بارے میں کوئی سوالات ہیں، تو براہ کرم ہم سے رابطہ کریں: ای میل: support@expensenest.com

# privacy_policy_title
source: Privacy Policy
ur: پرائیویسی پالیسی

# privacy_policy_app_name
source: ExpenseNest - Privacy Policy
ur: ExpenseNest - پرائیویسی پالیسی

# privacy_policy_last_updated
source: Last updated: November 12, 2024
ur: آخری مرتبہ اپڈیٹ: 12 نومبر، 2024

# privacy_policy_intro
source: This Privacy Policy outlines how ExpenseNest collects, uses, and protects your personal information when you use our service. By using the app, you agree to the collection and use of information in accordance with this policy.
ur: یہ پرائیویسی پالیسی بتاتی ہے کہ ExpenseNest آپ کی ذاتی معلومات کو کس طرح جمع کرتا ہے، استعمال کرتا ہے، اور آپ کی خدمت کے استعمال کے دوران اس کی حفاظت کرتا ہے۔ ایپ استعمال کرکے، آپ اس پالیسی کے مطابق معلومات کے جمع کرنے اور استعمال کرنے پر رضا مندی دیتے ہیں۔

# privacy_policy_info_collect
source: Information We Collect
ur: ہم کون سی معلومات جمع کرتے ہیں

# privacy_policy_info_collect_details
source: We may collect the following types of data: - Personal Data: This includes information such as your email address, name, and usage data. - Usage Data: Information automatically collected during your use of the app, such as your device's IP address, browser type, and pages visited.
ur: ہم درج ذیل قسم کی معلومات جمع کر سکتے ہیں: - ذاتی ڈیٹا: اس میں آپ کا ای میل ایڈریس، نام، اور استعمال کی معلومات شامل ہیں۔ - استعمال کی معلومات: ایپ کے استعمال کے دوران خود بخود جمع کی جانے والی معلومات، جیسے آپ کے ڈیوائس کا آئی پی ایڈریس، براؤزر کی قسم، اور دیکھی گئی صفحات۔

# privacy_policy_use_info
source: How We Use Your Information
ur: ہم آپ کی معلومات کس طرح استعمال کرتے ہیں

# privacy_policy_use_info_details
source: Your information may be used for the following purposes: - To provide and improve our service. - To manage your account and communicate updates. - To send marketing communications (you can opt-out anytime).
ur: آپ کی معلومات کو درج ذیل مقاصد کے لیے استعمال کیا جا سکتا ہے: - ہماری خدمت کو فراہم کرنے اور اس میں بہتری لانے کے لیے۔ - آپ کا اکاؤنٹ منظم کرنے اور اپڈیٹس فراہم کرنے کے لیے۔ - مارکیٹنگ کی کمیونیکیشن بھیجنے کے لیے (آپ کسی بھی وقت ان سبسکرائب کر سکتے ہیں)۔

# privacy_policy_sharing_info
source: Sharing Your Information
ur: ہم آپ کی معلومات کا اشتراک کس کے ساتھ کرتے ہیں

# privacy_policy_sharing_info_details
source: We do not share your personal data with third parties except for: - Service Providers: To facilitate the service. - Business Transfers: In case of a merger or acquisition.
ur: ہم آپ کے ذاتی ڈیٹا کو تیسرے فریق کے ساتھ اس کے سوا نہیں شیئر کرتے: - سروس فراہم کنندگان: سروس کو فعال کرنے کے لیے۔ - کاروباری منتقلی: کسی انضمام یا حصول کی صورت میں۔

# privacy_policy_data_retention
source: Data Retention
ur: ڈیٹا کی برقرار رکھنے کی مدت

# privacy_policy_data_retention_details
source: We retain your data only for as long as necessary for the purposes outlined in this Privacy Policy.
ur: ہم آپ کا ڈیٹا صرف اس وقت تک رکھتے ہیں جب تک کہ اس پرائیویسی پالیسی میں بتائے گئے مقاصد کے لیے ضروری ہو۔

# privacy_policy_security
source: Security
ur: سیکیورٹی

# privacy_policy_security_details
source: We implement reasonable security measures to protect your personal data, but cannot guarantee its absolute security due to the nature of online data transmission.
ur: ہم آپ کے ذاتی ڈیٹا کو تحفظ دینے کے لیے معقول سیکیورٹی اقدامات نافذ کرتے ہیں، لیکن آن لائن ڈیٹا کی منتقلی کی نوعیت کی وجہ سے اس کی مکمل سیکیورٹی کی ضمانت نہیں دے سکتے۔

# privacy_policy_rights
source: Your Rights
ur: آپ کے حقوق

# privacy_policy_rights_details
source: You have the right to access, update, or delete your personal data by contacting us or through your account settings.
ur: آپ کے پاس اپنے ذاتی ڈیٹا تک رسائی حاصل کرنے، اپڈیٹ کرنے یا حذف کرنے کا حق ہے۔ آپ ہم سے رابطہ کرکے یا اپنے اکاؤنٹ کی ترتیبات کے ذریعے یہ کر سکتے ہیں۔

# privacy_policy_changes
source: Changes to This Policy
ur: اس پالیسی میں تبدیلیاں

# privacy_policy_changes_details
source: We may update this Privacy Policy from time to time. Any changes will be posted here with the updated date.
ur: ہم وقتاً فوقتاً اس پرائیویسی پالیسی کو اپڈیٹ کر سکتے ہیں۔ کوئی بھی تبدیلیاں یہاں پوسٹ کی جائیں گی اور اپڈیٹ کی تاریخ دی جائے گی۔

# privacy_policy_contact
source: Contact Us
ur: ہم سے رابطہ کریں

# privacy_policy_contact_details
source: If you have any questions or concerns, please contact us at: Email: support@expensenest.com
ur: اگر آپ کو کوئی سوالات یا تشویشات ہیں، تو براہ کرم ہم سے رابطہ کریں: ای میل: support@expensenest.com

source: Confirm
ur: تصدیق کریں

# logout_confirmation_title
source: Are you sure you want to log out?
ur: کیا آپ واقعی لاگ آؤٹ کرنا چاہتے ہیں؟

# logout_confirmation_message
source: You will be logged out of your account.
ur: آپ کا اکاؤنٹ سے لاگ آؤٹ ہو جائے گا۔

source: Add Transaction
ur: ٹرانزیکشن شامل کریں

source: Edit Transaction
ur: ٹرانزیکشن ترمیم کریں

source: Profile updated successfully
ur: پروفائل کامیابی سے اپ ڈیٹ ہو گئی

# error_updating_profile
source: Error updating profile: {error}
ur: پروفائل اپ ڈیٹ کرنے میں خرابی: {error}

source: No image selected.
ur: کوئی تصویر منتخب نہیں کی گئی۔

# error_picking_image
source: Error picking image: {error}
ur: تصویر منتخب کرنے میں خرابی: {error}

source: Logged out successfully
ur: کامیابی سے لاگ آؤٹ ہو گئے

# delete_account_confirmation
source: Are you sure you want to delete your account? This action cannot be undone.
ur: کیا آپ واقعی اپنا اکاؤنٹ حذف کرنا چاہتے ہیں؟ یہ عمل ناقابل واپسی ہے۔

source: Account deleted successfully
ur: اکاؤنٹ کامیابی سے حذف ہو گیا

# error_during_logout
source: Error during logout: {error}
ur: لاگ آؤٹ کرنے میں خرابی: {error}

# error_deleting_account
source: Error deleting account: {error}
ur: اکاؤنٹ حذف کرنے میں خرابی: {error}

# pleaseFillAllFields
source: Please fill all required fields
ur: براہ کرم تمام مطلوبہ فیلڈز پُر کریں

source: Invalid input data
ur: غلط ان پٹ ڈیٹا

source: Transaction added successfully!
ur: ٹرانزیکشن کامیابی سے شامل کر دی گئی!

source: Transaction updated successfully!
ur: ٹرانزیکشن کامیابی سے اپ ڈیٹ ہو گئی!

# errorMessage
source: An error occurred: {error}
ur: ایک غلطی واقع ہوئی: {error}

source: This Year
ur: اس سال

source: This Month
ur: اس ماہ

source: This Week
ur: اس ہفتے

source: Yesterday
ur: کل

source: Today
ur: آج

source: All Time
ur: تمام وقت

# verifyEmail
source: Please verify your email
ur: براہ کرم اپنا ای میل تصدیق کریں

source: Login Successful!
ur: لاگ ان کامیاب!

# unexpectedError
source: An unexpected error occurred.
ur: ایک غیر متوقع غلطی ہوئی۔

source: Google Login Successful!
ur: گوگل کے ذریعے لاگ ان کامیاب!

source: Login canceled
ur: لاگ ان منسوخ کر دیا گیا

# checkEmail
source: Please check your email!!
ur: براہ کرم اپنے ای میل کو چیک کریں!!

# googleSignUpSuccess
source: Successfully signed up with Google!
ur: گوگل کے ذریعے کامیابی سے سائن اپ ہو گیا!

source: Login Screen
ur: لاگ ان اسکرین

source: Urdu
ur: اردو

# feedbackScreenTitle
source: Feedback
ur: رائے

# feedbackPrompt
source: Thank you for using our app! Your feedback is valuable, and it helps us improve.
ur: ہمارا ایپ استعمال کرنے کا شکریہ! آپ کی رائے بہت قیمتی ہے، اور اس سے ہمیں بہتری لانے میں مدد ملتی ہے۔

# feedbackHint
source: Type your feedback here...
ur: اپنی رائے یہاں ٹائپ کریں...

# sendFeedbackButton
source: Send Feedback
ur: رائے بھیجیں

# feedbackEmptyWarning
source: Please enter feedback before sending.
ur: رائے بھیجنے سے پہلے براہ کرم رائے درج کریں۔

source: Feedback email opened!
ur: رائے ای میل کھول لی گئی!

# feedbackEmailError
source: Failed to open email app
ur: ای میل ایپ کھولنے میں ناکامی
